<!DOCTYPE html>
<html lang="en">
    <head>
        <meta charset="UTF-8">
        <meta name="viewport" content="width=device-width, initial-scale=1.0">
        <link rel="stylesheet" href="css/style.css">
        <title>Фигуры</title>
    </head>
    <body>
        <header>
            <h1>Фигуры</h1>
            <nav>
                <ul>
                    <li><a href="/">Главная</a></li>
                    <li><a href="figure.php">Фигуры</a></li>
                    <li><a href="about.php">О сайте</a></li>
                    <li><a href="contact.php">Контакты</a></li>
                    <li><a href="review.php">Отзывы</a></li>
                </ul>
            </nav>
        </header>
        <main>
            <h2><b>Фигуры и их передвижение</b></h2>
            <p>В шахматы играют два соперника: один из них - белыми фигурами, второй - чёрными.
                У каждого из игроков по 16 фигур – один король, один ферзь, по две ладьи, по два слона, по два коня, и по восемь пешек.
            </p>
            <h3>
                <b>Пешка</b>
            </h3>
            <img src="images/2-min.png" alt="Пешка" class = "galleryfigure">
            <p>Самая слабая шахматная единица (её не принято считать фигурой)
                Ходит по вертикали на 1 клетку.(на 2 клетки в начале партии)
                Рубит по диагонали на 1 клетку.
                <p><u>Особенность</u> - пешка, достигшая последней горизонтали может "превратиться" в любую фигуру.</p>
            </p>
            <h3>
                <b>Конь</b>
            </h3>
            <img src="images/21-min.png" alt="Конь" class = "galleryfigure">
            <p>Шахматная фигура,расположенные рядом с ладьями — белые кони b1 и g1, чёрные b8 и g8. 
                Ходит и рубит траекторией, похожей на русскую букву «Г»
                <p><u>Особенность</u> - конь может "перепрыгивать" через другие фигуры.</p>
            </p>

            <h3>
                <b>Слон</b>
            </h3>
            <img src="images/3-min.png" alt="Слон" class = "galleryfigure">
            <p>Шахматная фигура. Игроки начинают игру с двумя слонами. В начале партии белые слоны занимают поля c1 и f1, черные — c8 и f8. 
                Перемещается либо только по белым полям, либо только по чёрным.
                Ходит на любое число полей по диагонали, при условии, что на его пути нет фигур.
            </p>
            <h3>
                <b>Ладья</b>
            </h3>
            <img src="images/4-min.png" alt="Ладья" class = "galleryfigure">
            <p>Ладья является тяжёлой фигурой, примерно эквивалентна 5 пешкам, а две ладьи равны ферзю. 
                Белые ладьи в начале партии занимают поля a1 и h1, чёрные — a8 и h8.
                Ходит и рубит на любое число полей по горизонтали или по вертикали при условии, что на её пути нет фигур
                <p><u>Особенность</u> - может участвовать в рокировке с королем.</p>
            </p>

            <h3>
                <b>Ферзь</b>
            </h3>
            <img src="images/5-min.png" alt="Ферзь" class = "galleryfigure">
            <p>Самая сильная шахматная фигура. В начале игры белый ферзь занимает поле d1, а чёрный — d8.
                В начальной позиции ферзь всегда занимает клетку своего цвета, отсюда и выражение: «Ферзь любит свой цвет».
                Ходит на любое число полей по вертикали, горизонтали или диагонали — соединяет в себе ходы ладьи и слона
            </p>

            <h3>
                <b>Король</b>
            </h3>
            <img src="images/6-min.png" alt="Король" class = "galleryfigure">
            <p>Король - самая главная фигура шахматной партии, и самая уязвимая. 
                Если королю поставлен мат (то есть у короля нет возможности пойти, и ему шах), то шахматная партия заканчивается.
                Он может ходить (и рубить фигуры противника) только на соседнее поле в любом направлении
                <p><u>Особенность</u> - может участвовать в рокировке с ладьей.</p>
            </p>
        </main>
        <footer>
            <p>&copy; 2024 Шахматы</p>
        </footer>
    </body>
</html>